app/controllers/articles_controller.rb

  def index
    @articles = Article.order(:published_at).page(params[:page])
---
SELECT  `articles`.* FROM `articles`  ORDER BY `articles`.`published_at` ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `articles`

  def create
    @article = Article.new(params.require( :article).permit( :title, :content, :author, :category, :published_at))
    if
      @article.save
---
INSERT INTO `articles` (`title`, `content`, `author`, `published_at`, `created_at`, `updated_at`) VALUES ('4TH article', 'conten tof 4th aarticle ', 'idk', '2022-04-12', '2022-04-13 02:07:19', '2022-04-13 02:07:19')

  def update
    @article = Article.find(params[ :id])
    if @article.update(params.require( :article).permit( :title, :content, :author, :category, :published_at))
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `published_at` = '2022-04-12', `updated_at` = '2022-04-13 02:08:52' WHERE `articles`.`id` = 9